what is pandas?
data manipulation and analysis
data mining library build on python 
offers
    data structures
    operation for manipulating numerical tables
    various formats
    merging and joining datasets
    time series and more

data:
    inputs from the environments
    it is an unprocessed facts
types:
    primary-person to person
    secondary-already pervious data 
best-structured data

series:
    one dimensional labelled array
    holding any data type
    size is immutable
    values are mutable
    nothing but a column in excel

data frame:
    two dimensional labelled array
    data allingned in tabular form
    size is mutable
    values are mutable
    combining two or more series

In [1]:
#pip install pandas

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.2'

In [4]:
#pip install --upgrade pandas --user

In [5]:
#pd.__version__

## ***SERIES***

In [6]:
s1=pd.Series([1,2,3,4,'five'],index=['a','b','c','d','e'])

In [7]:
print(s1)

a       1
b       2
c       3
d       4
e    five
dtype: object

In [16]:
s2=pd.Series(['v','i','j','a','y','a','vijaya'],index=[1,2,3,4,5,6,7])

In [17]:
print(s2)

1         v
2         i
3         j
4         a
5         y
6         a
7    vijaya
dtype: object

In [22]:
s3=pd.Series(["All purpose","stastical","base","app","web","ai","ml"],index=[1,2,3,4,5,6,7])

In [23]:
s3

1    All purpose
2      stastical
3           base
4            app
5            web
6             ai
7             ml
dtype: object

## ***DATA FRAME***

### ***variable_name=pd.DataFrame(data,column=[column name])***

In [24]:
df1=pd.DataFrame(s2,columns=['values'])

In [25]:
df1

   values
1       v
2       i
3       j
4       a
5       y
6       a
7  vijaya

In [26]:
df1["usage"]=s3

In [27]:
df1

   values        usage
1       v  All purpose
2       i    stastical
3       j         base
4       a          app
5       y          web
6       a           ai
7  vijaya           ml

In [28]:
Fruits={"seed":{1:"orange",2:"apple",3:"watermelon"},"seedless":{1:"grapes",2:"pineapple",3:"papaya"}}

In [32]:
df2=pd.DataFrame(Fruits,columns=["seed","seedless"])

In [33]:
df2

         seed   seedless
1      orange     grapes
2       apple  pineapple
3  watermelon     papaya

# Activity 1

create a data frame for your class ,containing "name","regno","year of study" as column names for 5 students

In [34]:
Students={"Name":{1:"viji",2:"kamali",3:"khatija",4:"sri",5:"thenu"},"regno":{1:"122011012836",2:"122011012803",3:"122011012817",4:"123012070001",5:"122011012813"},"year of study":{1:"III",2:"III",3:"III",4:"III",5:"III"}}

In [35]:
df3=pd.DataFrame(Students,columns=["Name","regno","year of study"])

In [36]:
df3

      Name         regno year of study
1     viji  122011012836           III
2   kamali  122011012803           III
3  khatija  122011012817           III
4      sri  123012070001           III
5    thenu  122011012813           III

In [41]:
df2.drop(3,axis=0)

     seed   seedless
1  orange     grapes
2   apple  pineapple

row:axis=0
column:axis=1